// general message
"message.error.default" = "Có lỗi trong quá trình xử lý.\nVui lòng thử lại.";
"message.otp.required" = "Vui lòng nhập OTP";
"message.cvv.required" = "Vui lòng nhập CVV/CVC/CVN";
"invalid-authentication" = "Lỗi xác thực.\nVui lòng thử lại.";
"message.error.no-supported-method" = "Không có hình thức thanh toán nào được hỗ trợ";
"message.install-%@-app" = "Không thể mở ứng dụng. Bạn cần cài đặt %@ để thanh toán.";
"message.open-%@-app" = "Mở ứng dụng %@";
"messsge.invalid-input" = "Payoo: Dữ liệu đầu vào không hợp lệ.";

// qr code
"qrcode-method.guideline.step1" = "Đăng nhập ứng dụng, Chọn chức năng Quét mã QR";
"qrcode-method.guideline.step2" = "Quét QR Code của giao dịch";
"qrcode-method.guideline.step3" = "Xác nhận thông tin giao dịch và hoàn tất thanh toán";
"qrcode-method.guideline.title" = "Hướng dẫn";
"qrcode-method.title" = "Quét mã QR";

// qr pay transfer
"qrpay-transfer.note" = "Lưu mã QR và sử dụng ứng dụng ngân hàng để thanh toán đơn hàng hoặc thực hiện thanh toán theo thông tin chuyển khoản bên dưới.";
"qrpay-transfer.order-no" = "Mã đơn hàng:";
"qrpay-transfer.amount" = "Số tiền:";
"qrpay-transfer.ref-no" = "Nội dung:";
"qrpay-transfer.app-supported.title" = "Ứng dụng ngân hàng hỗ trợ";
"qrpay-transfer.payment-excess-amount-%@" = "Bạn đã thanh toán dư %@.
Vui lòng liên hệ bộ phận Hỗ trợ Khách hàng của chúng tôi để được hỗ trợ hoàn lại số tiền dư.";
"qrpay-transfer.payment-lack-of-amount-%@" = "Bạn đã thanh toán thiếu %@. Vui lòng tiếp tục thanh toán để đơn hàng được hoàn tất.";
"qrpay-transfer.result-note" = "Thông tin giao dịch sẽ được cập nhật theo số tiền thực chuyển.";
"qrpay-transfer.refund-note" = "Trường hợp muốn hủy đơn hàng và hoàn lại số tiền đã chuyển, vui lòng liên hệ bộ phận Hỗ trợ Khách hàng để được trợ giúp.";
"qrpay-transfer.buton.title.continue-payment" = "Tiếp tục thanh toán";
"qrpay-transfer.order-info.amount" = "Số tiền đơn hàng";
"qrpay-transfer.order-info.transfered-amount" = "Số tiền đã chuyển";
"qrpay-transfer.order-info.excess-amount" = "Số tiền chuyển dư";
"qrpay-transfer.order-info.lack-of-amount" = "Số tiền chuyển thiếu";
"qrpay-transfer.order-info.actual-transferred-amount" = "Số tiền thực chuyển";
"qrpay-transfer.order-info" = "Thông tin đơn hàng";
"qrpay-transfer.guideline.step1" = "Lưu hình QR vào Thư viện hình ảnh trên thiết bị";
"qrpay-transfer.guideline.step2" = "Mở chức năng quét mã QR trên ứng dụng ngân hàng";
"qrpay-transfer.guideline.step3" = "Chọn tải lên hình ảnh QR vừa lưu từ Thư viện hình ảnh của thiết bị";
"qrpay-transfer.guideline.step4" = "Kiểm tra thông tin giao dịch và tiến hành thanh toán";
"qrpay-transfer.share-qr-code" = "Chia sẻ mã QR";
"qrpay-transfer.save-qr-code" = "Lưu mã QR";
"qrpay-transfer.save-qr-code-successfully" = "Đã lưu mã QR";
"qrpay-transfer.transfer-info" = "Thông tin chuyển khoản";
"qrpay-transfer.account-no" = "Số tài khoản";
"qrpay-transfer.qrcode.ref-no-note" = "Bạn cần nhập chính xác nội dung trên để đơn hàng được thanh toán thành công.";
"qrpay-transfer.confirm-leave-%@" = "Bạn đã thanh toán %@ cho đơn hàng trị giá %@. Bạn có chắc muốn thoát và kết thúc quá trình thanh toán?";
"qrpay-transfer.confirm-leave" = "Bạn có chắc chắn muốn thoát khỏi quá trình thanh toán này?";
"qrpay-transfer.leave" = "Thoát";

// placeholder
"place-holder.%@-number-of-digits" = "%@ số";
"place-holder.card-holder-name" = "Nhập ít nhất 1 khoảng trắng ở giữa";
"place-holder.card-input.phone" = "Nhận hỗ trợ và khuyến mãi (nếu có)";
"place-holder.period" = "Vui lòng chọn kỳ hạn trả góp";

// title
"info.title-table.contact" = "THÔNG TIN LIÊN HỆ";
"info.title-table.card" = "THÔNG TIN THẺ";
"info.title-table.payment" = "THÔNG TIN THANH TOÁN";
"info.title-table.recurring" = "THÔNG TIN THANH TOÁN TỰ ĐỘNG";

// fields
"fullname" = "Họ tên";
"issuance-date" = "Ngày phát hành";
"expiry-date" = "Ngày hết hạn";
"expiry-date-hint" = "Vui lòng nhập ngày hết hạn (Valid thru) nếu có trên thẻ";
"card-holder-name" = "Tên in trên thẻ";
"phone" = "Số điện thoại";
"phone-placeholder" = "Nhận hỗ trợ và thông tin khuyến mãi";
"email" = "Email";
"email-placeholder" = "Nhận thông tin thanh toán";
"card-type" = "Loại thẻ";
"payment" = "Thanh toán";
"fee" = "Phí";
"total" = "Tổng tiền";
"estimated-amount" = "Tạm tính";
"card-number" = "Số thẻ";
"supported-banks" = "Ngân hàng hỗ trợ";
"payment-code" = "Mã đơn hàng";
"please-pay-by" = "Thanh toán trước";
"order-no" = "Mã đơn hàng";
"cash-amount" = "Số tiền";
"order-info-note" = "Quý khách có thể ghi lại hoặc chụp màn hình để lưu thông tin nếu không nhận được tin nhắn hoặc email.";
"finding-store-note" = "Sau khi nhận mã thanh toán, Quý khách cung cấp mã cho giao dịch viên tại cửa hàng gần nhà để thanh toán:";
"period" = "Kỳ hạn trả góp";
"total-amount" = "Tổng tiền";
"digits" = "số";
"transaction-authentication" = "Xác nhận giao dịch";
"internet-banking-note" = "Thẻ của Quý khách cần được kích hoạt chức năng thanh toán trực tuyến hoặc dịch vụ Internet Banking trước khi thực hiện giao dịch.";
"note" = "Lưu ý";
"copied-successfully" = "Sao chép thành công";
"show" = "Hiển thị";
"hide" = "Ẩn";
"contact-no" = "Số hợp đồng";
"payment-start-date" = "Ngày thanh toán kỳ đầu";
"recurring-amount" = "Tiền thanh toán định kỳ";
"billing-date" = "Ngày thanh toán cố định";
"billing-cycle" = "Chu kỳ thanh toán";
"day-per-time" = "ngày/lần";
"optional" = "Không bắt buộc";

// general button title
"button.title.ok" = "Đồng ý";
"button.title.cancel" = "Hủy";
"button.title.close" = "Đóng";
"button.title.retry" = "Thử lại";
"button.title.continue" = "Tiếp tục";
"button.title.pay" = "Thanh toán";
"button.title.leave" = "Rời khỏi";
"button.title.find-store-near-you" = "Tìm cửa hàng gần Bạn";
"button.title.submit" = "Xác nhận";
"button.title.complete-payment" = "Hoàn Tất Thanh Toán";
"button.title.share" = "Chia Sẻ";
"button.title.install" = "Cài Đặt";
"button.title.open" = "Mở";
"button.title.delete" = "Xoá";
"button.title.change" = "Thay đổi";
"button.title.done" = "Xong";

// general alert title
"alert.title.error" = "Lỗi";
"alert.title.confirm" = "Xác nhận";
"alert.title.success" = "Thành công";
"alert.title.message" = "Thông báo";
"alert.title.warning" = "Cảnh báo";

// screen title
"screen.title.domestic-card-number" = "Nhập số thẻ";
"screen.title.domestic-card-info" = "Nhập thông tin thẻ";
"screen.title.international-card-info" = "Nhập thông tin thẻ";
"screen.title.confirm" = "Xác nhận thanh toán";
"screen.title.select-payment-card" = "Chọn thẻ thanh toán";
"screen.title.contact-info" = "Thông tin liên hệ";
"screen.title.payment-code" = "Mã thanh toán";
"screen.title.payment-result" = "Kết quả thanh toán";
"screen.title.supported-applications" = "ỨNG DỤNG HỖ TRỢ";
"screen.title.qr-code" = "Quét mã QR";
"screen.title.select-source" = "Hình thức thanh toán";
"screen.title.select-periods" = "Chọn kỳ hạn";
"screen.title.qr-bank" = "QR Bank";

// validate
"validate.enter-required-info" = "Vui lòng nhập thông tin";
"validate.select-required-info" = "Vui lòng chọn thông tin";
"validate.%@-is-not-international-card" = "Đầu số %@ không thuộc thẻ nội địa";
"validate.invalid" = "Không hợp lệ";
"validate.invalid.card-number" = "Số thẻ không đúng";
"validate.bankcode-%@-prefix-%@-not-supported" = "Chưa hỗ trợ %@ đầu số %@";
"validate.prefix-%@-not-supported" = "Chưa hỗ trợ đầu số %@";
"validate.international-prefix-%@-not-supported" = "Chưa hỗ trợ thẻ quốc tế đầu số %@";
"validate.invalid.card-number-range" = "Số thẻ từ %d đến %d số.\nVui lòng nhập lại";
"validate.invalid.card-number-length" = "Số thẻ gồm %@ số.\nVui lòng nhập lại";
"validate.invalid-card-info-or-not-support" = "Thông tin thẻ không hợp lệ hoặc thuộc ngân hàng chưa được hỗ trợ";
"validate.invalid-money-total" = "%@ áp dụng thanh toán với đơn hàng từ %@ tới %@";
"validate.bank-%@-not-support-installment-%@-prefix" = "Ngân hàng %@ không hỗ trợ trả góp cho thẻ có đầu số %@";
"validate.bank-%@-min-%@-max-%@-amount-%@-installment" = "%@ áp dụng trả góp với đơn hàng từ %@ đến %@";

// payment
"payment.finish-confirm" = "Bạn đang trong quá trình thực hiện thanh toán. Nhấn \"Hoàn Tất Thanh Toán\" nếu bạn đã hoàn thành tất cả các bước.";
"payment.amount-under-min" = "Số tiền thanh toán nhỏ hơn giới hạn định mức của ngân hàng.";
"payment.amount-greater-max" = "Số tiền thanh toán lớn hơn giới hạn định mức của ngân hàng.";
"payment.deposit-times-greater-max-per-day" = "Số lần nạp tiền trong một ngày lớn hơn giới hạn định mức của ngân hàng.";
"payment.deposit-money-greater-max-per-day" = "Tổng tiền thanh toán trong một ngày lớn hơn giới hạn định mức của ngân hàng.";
"payment.wallet-not-activated" = "VĐT của Bạn chưa kích hoạt. Vui lòng kiểm tra email và kích hoạt Ví.";
"payment.wallet-locked" = "VĐT của Bạn hiện đang bị tạm khóa. Vui lòng liên hệ Bộ phận Hỗ trợ khách hàng để được trợ giúp.";
"payment.wallet-locked-forever" = "VĐT của Bạn hiện đang bị khóa. Vui lòng liên hệ Bộ phận Hỗ trợ khách hàng để được trợ giúp.";
"payment.invalid-card-number" = "Số thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-name" = "Tên in trên thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-issuance-date" = "Ngày phát hành thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-card-expiry-date" = "Ngày hết hạn không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.invalid-account" = "Tài khoản không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.expired-token" = "Thao tác của Bạn vượt quá thời gian qui định. Vui lòng thực hiện lại qui trình.";
"payment.locked-card" = "Thẻ đã hết hạn hoặc bị khóa. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.locked-account" = "Tài khoản bị khóa. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.card-not-registered" = "Thẻ chưa đăng ký (hoặc chưa hỗ trợ) giao dịch thanh toán trực tuyến. Vui lòng liên hệ ngân hàng phát hành thẻ của Quý khách để được hỗ trợ.";
"payment.limited-payment" = "Tài khoản/Thẻ không đủ số dư hoặc đã vượt quá hạn mức thanh toán.";
"payment.money-not-enough" = "Tài khoản/Thẻ không đủ số dư hoặc đã vượt quá hạn mức thanh toán.";
"payment.invalid-card-info" = "Thông tin thẻ không đúng. Quý khách vui lòng kiểm tra lại.";
"payment.payment-fee-null" = "Dịch vụ/Nhà cung cấp này không chấp nhận thanh toán có tính phí. Vui lòng thanh toán qua hình thức khác.";
"payment.card-transtype-out-limit" = "Thẻ %@ đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.device-transtype-out-limit" = "Thiết bị này đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.card-out-limit-app" = "Thẻ %@ đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.device-out-limit-app" = "Thiết bị này đã hết hạn mức thanh toán trên ứng dụng (%@/%@).";
"payment.card-out-limit" = "Thẻ %@ đã hết hạn mức thanh toán (%@/%@).";
"payment.device-out-limit" = "Thiết bị này đã hết hạn mức thanh toán (%@/%@).";
"payment.validity-greater-%d-months" = "Thẻ tín dụng cần có hiệu lực tối thiểu %d tháng để được đăng ký trả góp.";
"payment.validity-greater-installment" = "Thời hạn hiệu lực còn lại của Thẻ tín dụng phải lớn hơn thời hạn đăng ký trả góp.";
"payment.validity-greater-or-equal-installment" = "Thời hạn hiệu lực còn lại của Thẻ tín dụng phải lớn hơn hoặc bằng thời hạn đăng ký trả góp.";
"payment.order-expired" = "Đơn hàng không tồn tại hoặc đã hết hạn thanh toán.";
"payment.card-not-support-internal" = "Vì lý do bảo mật, giao dịch của Bạn sẽ được chuyển sang thực hiện trên trình duyệt web.";

// otp
"otp.invalid-repay" = "Mã xác thực OTP Bạn nhập không đúng hoặc đã hết hiệu lực. Vui lòng thực hiện lại giao dịch.";

// webview
"webview.close.confirm" = "Giao dịch chưa được hoàn tất. Bạn có chắc muốn rời khỏi trang?";

// save card option view
"label.save-card.description" = "Lưu thông tin thẻ để sử dụng cho những lần thanh toán sau.";

"payment-token.remove.confirm" = "Bạn có chắc muốn xóa thẻ này?";
"payment-token.remove.success" = "Xóa thẻ thành công!";
"payment-token.saved-card-not-found" = "Không tồn tại thẻ đã lưu";

// pci
"pci-secure.description" = "Giao dịch an toàn với PCI-DSS và ISO 27001";

// payment result
"time-unit-(second).title" = "giây";
"customer-support.title" = "Chăm sóc khách hàng";
"connected-with.title" = "Dịch vụ liên kết với";
"payment-success.title" = "Thanh toán thành công";
"payment-failed.title" = "Thanh toán thất bại";
"payment-uncompleted.title" = "Thanh toán chưa hoàn tất";
"time-remaining.title" = "Thời Gian Còn Lại:";
"powered-by" = "Dịch vụ liên kết với";

// payment order info
"order-info.close-processing-warning" = "Vui lòng KHÔNG tắt màn hình này.";
"order-info.processing.title" = "Đang Xử Lý";
"order-info.time-left.title" = "Còn lại";
"order-info.timeout" = "Có lỗi trong quá trình xử lý. Chúng tôi xin lỗi về sự bất tiện này. Quý khách vui lòng liên hệ 1900 54 54 78 để được hỗ trợ.";

//Selected period
"select-period.money-per-month" = "%@/tháng";
"select-period.subtitle" = "Thẻ của Quý khách không được hỗ trợ cho kỳ hạn %d tháng tại ngân hàng. Vui lòng chọn lại kỳ hạn bên dưới để tiếp tục giao dịch.";
"select-period.non-support-period" = "Thẻ của Quý khách không được hỗ trợ cho kỳ hạn %d tháng tại ngân hàng. Vui lòng kiểm tra lại hoặc liên hệ với ngân hàng phát hành thẻ để biết thêm chi tiết.";
"select-period.not-found-message" = "Không tìm thấy kỳ hạn trả góp. Vui lòng kiểm tra lại thông tin đơn hàng.";
